---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CutterFailures.MakeCutterForPlanRegionsGStepFailed
source: html/7f981434-ccb0-4b05-1388-7631dd7f874b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CutterFailures.MakeCutterForPlanRegionsGStepFailed Property

Failed to make cutter for plan view with plan regions. Try deleting one or more plan regions.

## Syntax (C#)
```csharp
public static FailureDefinitionId MakeCutterForPlanRegionsGStepFailed { get; }
```